// FileSyncAgent Localizable.strings

// The name of the product
"FileSyncAgent" = "Tiedostojen synkronointi";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Kumoa";

// Text of "Next" button, used in various dialogs
"NEXT" = "Seuraava";

// Text of "Done" button, used in various dialogs
"DONE" = "Valmis";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Jatka";

// The name of iDisk disk image when renamed and moved to the desktop when iDisk syncing is disabled.
// The argument is the user's .Mac name.
// The optional second argument is a counter, for when a .dmg already exists. E.g. "Previous local iDisk for jholt 3.dmg"
"PREVIOUS DMG%"    = "Käyttäjän %@ aiempi paikallinen iDisk";
"PREVIOUS DMG DIR" = "Aiemmat paikalliset iDiskit";

// These strings are used after migrating a Tiger local iDisk image to Leopard (and later) iDisk syncing  [rdar://6607831]
"MIGRATION_COMPLETE" = "Tällä tietokoneella on vanha kopio paikallisesta iDiskistä, joka vie %@ levytilaa. Haluatko pitää sen vai siirtää sen roskakoriin?";
"MIGRATION_DESKTOP"  = "Pidä";
"MIGRATION_TRASH"    = "Siirrä roskakoriin";

// These strings are used to ask the user what to do with old and orphaned local iDisk images from all versions of iDisk syncing.  [rdar://6232713]
// Images can be found on the Desktop (moved there when iDisk syncing has been turned off in the past), as well as ~/Library/Mirrors (Tiger) and ~/Libary/FileSync (Leopard+)
// The code tracks where the images are found and presents three variants depending on where the images are (~/Desktop and/or ~/Library (i.e., INTERNAL)
"CLEANUP_IMAGES_DESK_1"         = "Tällä tietokoneella on vanha kopio paikallisesta iDiskistä, joka vie %@ levytilaa. Haluatko pitää sen vai siirtää sen roskakoriin?";
"CLEANUP_IMAGES_INTERNAL_1"     = "Tällä tietokoneella on vanha kopio paikallisesta iDiskistä, joka vie %@ levytilaa. Haluatko pitää sen vai siirtää sen roskakoriin?";
"CLEANUP_IMAGES_DESK_MULTI"     = "Tällä tietokoneella on useita vanhoja kopioita paikallisesta iDiskistä, jotka vievät %@ levytilaa. Haluatko pitää ne vai siirtää ne roskakoriin?";
"CLEANUP_IMAGES_INTERNAL_MULTI" = "Tällä tietokoneella on useita vanhoja kopioita paikallisesta iDiskistä, jotka vievät %@ levytilaa. Haluatko pitää ne vai siirtää ne roskakoriin?";
"CLEANUP_IMAGES_ALL"            = "Tällä tietokoneella on useita vanhoja kopioita paikallisesta iDiskistä, jotka vievät %@ levytilaa. Haluatko pitää ne vai siirtää ne roskakoriin?";

"CLEANUP_TITLE_1"     = "Toinen kopio iDiskistä löytyi tietokoneelta.";
"CLEANUP_TITLE_MULTI" = "Muita kopioita iDiskistä löytyi tietokoneelta.";

"Keep"  = "Pidä";
"Trash" = "Siirrä roskakoriin";

// ----------------------------------
// "Your iDisk is almost full" dialog

"IDISK ALMOST FULL" = "iDisk on lähes täynnä.";

// Text of the "warn again" checkbox.
"DO NOT WARN AGAIN" = "Älä varoita enää.";

// Trash has files, too.
"ALMOST FULL TRASH MSG" = "iDiskillä on tiedostoja, jotka sijaitsevat roskakorissa. Voit vapauttaa levytilaa tyhjentämällä roskakorin.\n\nVoit lisätä iDiskin kokoa Järjestelmäasetusten %@-osiosta.";

// No files in trash.
"ALMOST FULL .MAC MSG" = "Voit lisätä iDiskin kokoa Järjestelmäasetusten %@-osiosta.";


// ----------------------------
// "Resizing your iDisk" dialog

"RESIZE IDISK"     = "Omalla tietokoneella olevan iDiskin kokoa on muutettava.";
"RESIZE IDISK MSG" = "Omalla tietokoneella oleva iDisk on koon muuttamisen aikana väliaikaisesti poissa käytöstä.";


// ----------------------------------
// "Can't turn off your iDisk" dialog

"CANT DISABLE"          = "Paikallista iDiskiä ei voida poistaa käytöstä.";
"CANT DISABLE BUSY MSG" = "Paikallista iDiskiä ei voida poistaa käytöstä nyt, koska se sisältää avoinna olevia tiedostoja. Sulje tiedostot ja yritä uudelleen.";
"CANT DISABLE ERR MSG%" = "Paikallista iDiskiä ei voida poistaa käytöstä nyt, koska tapahtui virhe %d. Yritä myöhemmin uudelleen.";


// ---------------------------
// "log out / continue" dialog

"LOGOUT BUSY"     = "iDiskiä synkronoidaan. Haluatko jatkaa vai kirjautua ulos?";
"LOGOUT BUSY MSG" = "Voit kirjautua ulos, kun iDisk on synkronoitu.";

// Text of the "log out" button.
"LOGOUT" = "Kirjaudu ulos";

// Text of the "continue" button.
"CONTINUE SYNC" = "Jatka synkronointia";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%qu tavua";
"%KB"    = "%.2f Kt";
"%MB"    = "%.2f Mt";
"%GB"    = "%.2f Gt";
"%TB"    = "%.2f Tt";
"%PB"    = "%.2f Pt";
"%XB"    = "%.2f Xt";


// ----------------------------------
// Finder status messages

"Cleaning up..."                 = "Siivotaan…";
"Last sync cancelled."           = "Edellinen synkronointi kumottiin.";
"Finder Settings"                = "Finder-asetukset";				// [rdar://4735199]

// "DM_ACCOUNT_EXPIRED" was "Your %@ account has expired." prior to 10.5.3
"DM_ACCOUNT_EXPIRED"             = "%@-tili on vanhentunut.";
"CREATE FAILED:NIL DMA"          = "iDisk-synkronointia ei voida ottaa käyttöön. Tarkista %@-käyttäjätunnus ja -salasana Järjestelmäasetusten %@-osiossa.";
"CREATE FAILED:NO USERNAME"      = "iDisk-synkronointia ei voida ottaa käyttöön. Tarkista %@-käyttäjätunnus ja -salasana Järjestelmäasetusten %@-osiossa.";
"CREATE FAILED:TOO BIG"          = "iDiskin synkronointia ei voida laittaa päälle. iDisk on suurempi kuin käytettävissä oleva vapaa tila.";
"CREATE FAILED:UNKNOWN"          = "iDisk-synkronointia ei voida laittaa päälle. Yritä myöhemmin uudelleen.";
"Cannot sync more than one computer at a time."	= "Toinen tietokone synkronoi juuri tätä tiliä. Yritä myöhemmin uudelleen.";
"iDisk syncing unavailable."					= "iDisk-synkronointi ei ole tällä hetkellä käytettävissä. Yritä uudelleen myöhemmin.";

// Was not localized prior to 10.5.3 (oops!)
"NO_ACTIVE_IDISK"                = "%@-tililläsi ei ole aktiivista iDiskiä.";
